# =====================================================================================
# КОНФІГУРАЦІЯ S3 БЕКЕНДУ
# =====================================================================================
# Для гібридної архітектури (LocalStack / Real AWS) - даний блок чисто для перевірки ДЗ
#
# Для LocalStack Pro: deploy-local dev - Terraform читає наш закоментований backend.tf,
# розуміє, що віддаленого бекенду немає, і зберігає стейт локально
#
# Для AWS: deploy-aws - Terragrunt ігнорує наш пустий/закоментований backend.tf,
# і підставляє свій розумний власно-згенерований файл на основі з terragrunt.hcl.
# =====================================================================================

terraform {
  # Приклад конфігурації для ручного розгортання в AWS:
  # backend "s3" {
  #   bucket         = "ironkage-hw10-prod-terraform-state"
  #   key            = "state/terraform.tfstate"
  #   region         = "eu-central-1"
  #   encrypt        = true
  #   dynamodb_table = "ironkage-hw10-prod-terraform-locks"
  # }
}
